[{
  "_id": {
    "$oid": "64f94c6b956ee4dc69e785e8"
  },
  "bi_grams": "[CHETHAN REDDY, Vellore Institute, Vellore India, India Jun, Electrical Engineering, Engineering Minors, Computer Science, Bajaj Finserv, Finserv Health, SDE Intern, Intern Data, Data Team, usercentric lab, lab test, test recommendation, recommendation systems, systems increasing, increasing efficiency, •Employed advanced, advanced technologies, technologies including, including LLMs, LLMs OCR, OCR NER, precise image, image analytics, •Optimized data, data retrieval, retrieval processes, processes achieving, speed enhancement, SDE Intern, Intern BackEnd, BackEnd Team, Team Nov, backend development, Physio Plus, seamless patient, patient data, data manage, + daily, daily patient, patient appointments, appointments leveraging, leveraging AWS, distributed architecture, Smart Diet, Diet Planner, AI Intern, Intern Aug, •Implemented AI, AI solutions, solutions including, including search, search engines, automated PDF, PDF analysis, enhance app, app functionality, •Enhanced user, user experience, 850k+ users, advanced AI, AI features, improved interaction, Supplier Performance, Performance Aug, innovative algorithm, optimal supplier, supplier selection, •Achieved substantial, cost savings, efficiently optimized, optimized resource, resource allocation, Keywords Recommendation, Recommendation Engine, Engine Jun, powerful AIdriven, AIdriven search, search engine, engine significantly, significantly improving, improving search, search efficiency, in800 ms, Finding Disruptions, CCTV Videos, Videos Apr, sophisticated algorithm, ML Mathematics, identify 5+types, •Provided precise, precise disruption, disruption reports, efficient analysis, EXTRACURRICULAR ACTIVITIES, runnerup Prize, Bajaj Finserv, SirionLabs HackFest, demonstrating innovation, technical prowess, IEEE Women, Engineering VIT, VIT WeHack, Amadeus Hack4Impact, Danfoss Makeathon, outstanding skills, Technical Skills, Skills C++, C++ Linux, Linux Java, Java Python, Python Machine, Machine Learning, Learning Objectoriented, Objectoriented Design, Design MySQL, MySQL Git, Git Data, Data Struc, tures Algorithms, Algorithms Design, Design Elastic, Elastic Search, Search MongoDB, MongoDB REST, REST APIs, APIs Postman, Postman Reactjs, Reactjs System, System Design, Design DevOps]",
  "clean_data": "CHETHAN REDDY\n+91  \nGithub  LinkedIn  Leetcode  Twitter\nEDUCATION\nVellore Institute of Technology  Vellore India Jun 2020  Jul 2024\nBTech in Electrical Engineering Minors in Computer Science  CGPA 836/10\nEXPERIENCE\nBajaj Finserv Health  SDE Intern Data Team  inSightRX May 2023  Jul 2023\n•Spearheaded the development of usercentric lab test recommendation systems increasing efficiency by 30% \n•Employed advanced technologies including LLMs OCR NER and YOLO for precise image analytics\n•Optimized data retrieval processes achieving a remarkable 80% speed enhancement\nTIFAC  VIT  Vellore  SDE Intern BackEnd Team Nov 2022  Mar 2023\n the backend development of Physio Plus using FastAPI and MongoDB for seamless patient data manage\nment\n•Managed over 100+ daily patient appointments leveraging AWS and distributed architecture for operational\nefficiency\nSmart Diet Planner  AI Intern Aug 2022  Nov 2022\n•Implemented AI solutions including search engines and automated PDF analysis to enhance app functionality\n•Enhanced user experience for 850k+ users through advanced AI features for improved interaction\nPROJECTS\nSupplier Performance Aug 2022  Sep 2022\n•Developed an innovative algorithm for optimal supplier selection from 6Mrecords using MongoDB\n•Achieved substantial 25% cost savings and efficiently optimized resource allocation\nKeywords Recommendation Engine Jun 2022  Jul 2022\n•Constructed a powerful AIdriven search engine significantly improving search efficiency by 70% in800 ms \nWeDio  Finding Disruptions in CCTV Videos Apr 2022  May 2022\n•Developed a sophisticated algorithm using ML Mathematics to identify 5+types of disruptions in videos\n•Provided precise disruption reports with timestamps for efficient analysis in various formats\nEXTRACURRICULAR ACTIVITIES\n•Earned 1st runnerup Prize in HackRx 30 2022 by Bajaj Finserv\n•Ranked Top 7in SirionLabs HackFest 2022  demonstrating innovation and technical prowess\n•Secured 1st Prize in IEEE Women In Engineering VIT WeHack 30 2022 \n•Recognized in Amadeus Hack4Impact  Top 5  and Danfoss Makeathon  Top 10  for outstanding skills and\ncontributions\nSKILLS\nTechnical Skills C++ Linux Java Python Machine Learning Objectoriented Design MySQL Git Data Struc\ntures Algorithms Design Elastic Search MongoDB REST APIs Postman Reactjs System Design DevOps",
  "emails": [
    "achethanreddy1921@gmail.com"
  ],
  "entities": [
    "Algorithms Design Elastic Search",
    "Electrical Engineering Minors in Computer Science  CGPA",
    "EDUCATION",
    "Postman Reactjs System Design DevOps",
    "Bajaj Finserv Health  SDE Intern Data Team  ",
    "Videos",
    "YOLO",
    "Vellore Institute of Technology  Vellore India",
    "OCR NER",
    "HackFest",
    "PROJECTS\nSupplier Performance Aug",
    "PDF",
    "VIT",
    "AWS",
    "BTech",
    "Leetcode",
    "SirionLabs",
    "AI",
    "Keywords Recommendation Engine",
    "ML Mathematics",
    "CCTV",
    "Github",
    "EXTRACURRICULAR",
    "LinkedIn",
    "Amadeus"
  ],
  "experience": "Skills C++ Linux Java Python Machine Learning Objectoriented Design MySQL Git Data Struc \n tures Algorithms Design Elastic Search MongoDB REST APIs Postman Reactjs System Design DevOps",
  "extracted_keywords": [
    "CHETHAN",
    "REDDY",
    "Github",
    "LinkedIn",
    "Leetcode",
    "Twitter",
    "EDUCATION",
    "Vellore",
    "Institute",
    "Technology",
    "Vellore",
    "India",
    "Jun",
    "Jul",
    "BTech",
    "Electrical",
    "Engineering",
    "Minors",
    "Computer",
    "Science",
    "836/10",
    "EXPERIENCE",
    "Bajaj",
    "Finserv",
    "Health",
    "SDE",
    "Intern",
    "Data",
    "Team",
    "May",
    "Jul",
    "development",
    "lab",
    "test",
    "recommendation",
    "systems",
    "efficiency",
    "%",
    "technologies",
    "LLMs",
    "OCR",
    "NER",
    "YOLO",
    "image",
    "analytics",
    "data",
    "retrieval",
    "processes",
    "%",
    "speed",
    "enhancement",
    "TIFAC",
    "VIT",
    "Vellore",
    "SDE",
    "Intern",
    "BackEnd",
    "Team",
    "Nov",
    "Mar",
    "development",
    "Physio",
    "FastAPI",
    "MongoDB",
    "data",
    "ment",
    "appointments",
    "AWS",
    "architecture",
    "efficiency",
    "Smart",
    "Diet",
    "Planner",
    "AI",
    "Intern",
    "Aug",
    "Nov",
    "AI",
    "solutions",
    "search",
    "engines",
    "PDF",
    "analysis",
    "app",
    "functionality",
    "user",
    "experience",
    "users",
    "AI",
    "features",
    "interaction",
    "PROJECTS",
    "Supplier",
    "Performance",
    "Aug",
    "Sep",
    "algorithm",
    "supplier",
    "selection",
    "6Mrecords",
    "MongoDB",
    "%",
    "cost",
    "savings",
    "resource",
    "allocation",
    "Keywords",
    "Recommendation",
    "Engine",
    "Jun",
    "Jul",
    "AIdriven",
    "search",
    "engine",
    "search",
    "efficiency",
    "%",
    "in800",
    "ms",
    "WeDio",
    "Finding",
    "Disruptions",
    "CCTV",
    "Videos",
    "Apr",
    "May",
    "algorithm",
    "ML",
    "Mathematics",
    "5+types",
    "disruptions",
    "videos",
    "disruption",
    "reports",
    "timestamps",
    "analysis",
    "formats",
    "ACTIVITIES",
    "runnerup",
    "Prize",
    "HackRx",
    "Bajaj",
    "Finserv",
    "Top",
    "SirionLabs",
    "HackFest",
    "demonstrating",
    "innovation",
    "prowess",
    "1st",
    "Prize",
    "Women",
    "Engineering",
    "VIT",
    "WeHack",
    "Amadeus",
    "Hack4Impact",
    "Top",
    "Danfoss",
    "Makeathon",
    "Top",
    "skills",
    "contributions",
    "SKILLS",
    "Technical",
    "Skills",
    "C++",
    "Linux",
    "Java",
    "Python",
    "Machine",
    "Learning",
    "Objectoriented",
    "Design",
    "MySQL",
    "Git",
    "Data",
    "Struc",
    "tures",
    "Algorithms",
    "Design",
    "Elastic",
    "Search",
    "MongoDB",
    "REST",
    "APIs",
    "Postman",
    "Reactjs",
    "System",
    "Design",
    "DevOps"
  ],
  "keyterms": [
    [
      "SDE Intern",
      0.21150743875202008
    ],
    [
      "Bajaj Finserv",
      0.1281789804702989
    ],
    [
      "search engine",
      0.06381943001566162
    ],
    [
      "Jul",
      0.035271762106891716
    ],
    [
      "Vellore",
      0.02845828083528418
    ],
    [
      "Jun",
      0.023984799317835027
    ],
    [
      "efficiency",
      0.02201108280862766
    ],
    [
      "Engineering",
      0.017836099627484784
    ],
    [
      "Data",
      0.01509408947637134
    ],
    [
      "advanced",
      0.014763725431343105
    ],
    [
      "Team",
      0.013389517793348332
    ],
    [
      "precise",
      0.01269372872087008
    ],
    [
      "development",
      0.012610774960812412
    ],
    [
      "datum",
      0.011715896178360516
    ],
    [
      "MongoDB",
      0.011647097060990446
    ],
    [
      "Nov",
      0.011338791812435979
    ],
    [
      "AI",
      0.011316530403811906
    ],
    [
      "Aug",
      0.009399592131909391
    ],
    [
      "patient",
      0.008040314777967255
    ],
    [
      "supplier",
      0.0072790983531983485
    ]
  ],
  "name": [
    "CHETHAN REDDY",
    "Github  Li"
  ],
  "phones": [],
  "resume_data": "CHETHAN REDDY\n+91-9030496717 — achethanreddy1921@gmail.com\nGithub — LinkedIn — Leetcode — Twitter\nEDUCATION\nVellore Institute of Technology - Vellore, India Jun 2020 - Jul 2024\nBTech in Electrical Engineering (Minors in Computer Science) — CGPA: 8.36/10\nEXPERIENCE\nBajaj Finserv Health — SDE Intern (Data Team - inSightRX) May 2023 - Jul 2023\n•Spearheaded the development of user-centric lab test recommendation systems, increasing efficiency by 30% .\n•Employed advanced technologies including LLMs, OCR, NER, and YOLO for precise image analytics.\n•Optimized data retrieval processes, achieving a remarkable 80% speed enhancement.\nTIFAC - VIT - Vellore — SDE Intern (Back-End Team) Nov 2022 - Mar 2023\n•Led the backend development of ”Physio Plus” using FastAPI and MongoDB for seamless patient data manage-\nment.\n•Managed over 100+ daily patient appointments, leveraging AWS and distributed architecture for operational\nefficiency.\nSmart Diet Planner — AI Intern Aug 2022 - Nov 2022\n•Implemented AI solutions including search engines and automated PDF analysis to enhance app functionality.\n•Enhanced user experience for 850k+ users through advanced AI features for improved interaction.\nPROJECTS\nSupplier Performance Aug 2022 - Sep 2022\n•Developed an innovative algorithm for optimal supplier selection from 6Mrecords, using MongoDB.\n•Achieved substantial 25% cost savings and efficiently optimized resource allocation.\nKeywords Recommendation Engine Jun 2022 - Jul 2022\n•Constructed a powerful AI-driven search engine, significantly improving search efficiency by 70% in800 ms .\nWeDio - Finding Disruptions in CCTV Videos Apr 2022 - May 2022\n•Developed a sophisticated algorithm using ML Mathematics to identify 5+types of disruptions in videos.\n•Provided precise disruption reports with timestamps for efficient analysis in various formats.\nEXTRA-CURRICULAR ACTIVITIES\n•Earned 1st runner-up Prize in HackRx 3.0, 2022 by Bajaj Finserv.\n•Ranked Top 7in SirionLabs HackFest, 2022 , demonstrating innovation and technical prowess.\n•Secured 1st Prize in IEEE Women In Engineering VIT WeHack 3.0, 2022 .\n•Recognized in Amadeus Hack4Impact ( Top 5 ) and Danfoss Make-a-thon ( Top 10 ) for outstanding skills and\ncontributions.\nSKILLS\nTechnical Skills: C++, Linux, Java, Python, Machine Learning, Object-oriented Design, MySQL, Git, Data Struc-\ntures, Algorithms Design, Elastic Search, MongoDB, REST APIs, Postman, React.js, System Design, Dev-Ops",
  "tri_grams": "[Institute of Technology, Vellore India Jun, BTech in Electrical, Electrical Engineering Minors, Minors in Computer, Bajaj Finserv Health, SDE Intern Data, Intern Data Team, •Spearheaded the development, development of usercentric, usercentric lab test, lab test recommendation, test recommendation systems, recommendation systems increasing, systems increasing efficiency, •Employed advanced technologies, advanced technologies including, technologies including LLMs, including LLMs OCR, LLMs OCR NER, NER and YOLO, YOLO for precise, precise image analytics, •Optimized data retrieval, data retrieval processes, retrieval processes achieving, achieving a remarkable, SDE Intern BackEnd, Intern BackEnd Team, BackEnd Team Nov, development of Physio, Plus using FastAPI, FastAPI and MongoDB, MongoDB for seamless, seamless patient data, patient data manage, + daily patient, daily patient appointments, patient appointments leveraging, appointments leveraging AWS, AWS and distributed, architecture for operational, Smart Diet Planner, AI Intern Aug, •Implemented AI solutions, AI solutions including, solutions including search, including search engines, engines and automated, automated PDF analysis, analysis to enhance, enhance app functionality, •Enhanced user experience, experience for 850k+, users through advanced, advanced AI features, features for improved, Supplier Performance Aug, •Developed an innovative, algorithm for optimal, optimal supplier selection, selection from 6Mrecords, 6Mrecords using MongoDB, savings and efficiently, efficiently optimized resource, optimized resource allocation, Keywords Recommendation Engine, Recommendation Engine Jun, •Constructed a powerful, powerful AIdriven search, AIdriven search engine, search engine significantly, engine significantly improving, significantly improving search, improving search efficiency, Disruptions in CCTV, CCTV Videos Apr, •Developed a sophisticated, algorithm using ML, Mathematics to identify, 5+types of disruptions, disruptions in videos, •Provided precise disruption, precise disruption reports, reports with timestamps, timestamps for efficient, Prize in HackRx, innovation and technical, Prize in IEEE, Women In Engineering, Engineering VIT WeHack, •Recognized in Amadeus, Technical Skills C++, Skills C++ Linux, C++ Linux Java, Linux Java Python, Java Python Machine, Python Machine Learning, Machine Learning Objectoriented, Learning Objectoriented Design, Objectoriented Design MySQL, Design MySQL Git, MySQL Git Data, Git Data Struc, tures Algorithms Design, Algorithms Design Elastic, Design Elastic Search, Elastic Search MongoDB, Search MongoDB REST, MongoDB REST APIs, REST APIs Postman, APIs Postman Reactjs, Postman Reactjs System, Reactjs System Design, System Design DevOps]",
  "unique_id": "ed546d7c-95d7-442d-b912-34527fda4fbe",
  "years": [],
  "score": 449.8647932123125,
  "jobId": "AXIS171668",
  "emailBody": "Dear candidate,\n\nCongratulations on selecting a video interview for the Software Engineer position at hAIr! We are excited to learn more about you and your skills.\n\nPlease record your responses to the following questions and upload them to the link provided. Each response should be no more than 1 minute long.\n\n1. Tell us about your experience with machine learning. What are your strengths and weaknesses in this area?\n2. What are your thoughts on the future of artificial intelligence?\n3. What are your salary expectations?\n4. Why do you want to work at hAIr?\n5. What are your biggest strengths and weaknesses as a software engineer?\n\n**Link:** http://localhost:3001/firstRoundInterview\n\n**Candidate ID:** ed546d7c-95d7-442d-b912-34527fda4fbe\n\nWe look forward to hearing from you!\n\nSincerely,\n\nhAIr",
  "videoAnalysis": {
    "result": {
      "output": 85.5
    },
    "videoAnalysis": [
      {
        "label": {
          "Angry": 0.33860045146726864,
          "Happy": 3.724604966139955,
          "Neutral": 75.5079006772009,
          "Sad": 3.0474040632054176,
          "Surprise": 0
        },
        "processed": 886,
        "frames": 886
      },
      {
        "label": {
          "Angry": 0.13386880856760375,
          "Happy": 5.756358768406962,
          "Neutral": 29.183400267737618,
          "Sad": 4.149933065595716,
          "Surprise": 0
        },
        "processed": 747,
        "frames": 747
      },
      {
        "label": {
          "Angry": 0,
          "Happy": 7.3131955484896665,
          "Neutral": 64.94435612082671,
          "Sad": 2.305246422893482,
          "Surprise": 0
        },
        "processed": 1258,
        "frames": 1258
      },
      {
        "label": {
          "Angry": 1.1904761904761905,
          "Happy": 21.164021164021165,
          "Neutral": 41.7989417989418,
          "Sad": 6.084656084656085,
          "Surprise": 0
        },
        "processed": 756,
        "frames": 756
      }
    ],
    "audioAnalysis": [
      "Hello. Well, answering to the second question, my thoughts on artificial intelligence is that it's actually going to replace jobs of human beings. I've seen this live working in Bajaj, where we created an algorithm to automate the reimbursement process, and where we kicked off almost 120 to 150 agents who are manually testing reimbursement. Yeah, so machine learning. Sorry. Artificial intelligence is definitely going to take up jobs in future.",
      "Okay, now, trying to answer the third question. Well, my salary expectations are not really that heavy. I would just expect somewhere around 20 or 25 LPA. And I'll tell you why. Because I have almost two to three years of intense experience in solving real world problems with machine learning. So not really over frugal about my salary.",
      "Hello. Okay, well, I'm trying to answer the first question. So why my machine learning experience has been really good. So mostly my experience comes from participating in Hackathons, where I would love to solve really good problems with machine learning. And more than that, my strength is that I can literally solve any problem with machine learning and I can think of any kind of application machine learning in any domain. And my weakness is that I spend a lot of time on RND where I mess up with the actual algorithm, which I'm thinking for, to choose for that particular problem. So this, in fact, reduces the accuracy and other parameters of a machine learning algorithm.",
      "Well, why I want to work with Hair is that yeah, Hair has a really good, amazing opportunity where, for software engineers, like, you know well so software engineers are really paid off well, and you actually get to solve the problems which impact other people's life."
    ]
  }
},
{
  "_id": {
    "$oid": "64f94c70956ee4dc69e785e9"
  },
  "bi_grams": "[M POORNIKA, Computer Science, seeking opportunities, programming expertise, problem solving, solving skills, innovative environment, XII Aggregate, X Aggregate, logistics Developed, End Developer, end technologies, Rivie ra, actively participated, extracurricular activities, cultur al, like Riviera, develop leadership, event management, management abilities, Academic Projects, data Utilized, data servers, cutting edge, edge technologies, highly functional, effective blockchain, blockchain system, accessible user, user interface, Streamlit module, Chronic Kidney, Kidney Disease, Disease Prediction, ML Techniques, Develop ed, machine learning, learning model, early Chronic, Chronic Kidney, Kidney Disease, Disease CKD, CKD prediction, enabl ing, ing timely, delaying end, end stage, stage renal, renal failure, reducing CKD, global health, health impact, SC900 Microsoft, Microsoft Security, Security Compliance, Identity Fundamentals, Google Cloud, Soft Skills, Problem solving, Hard Worker, inCode’23 Hackathon]",
  "clean_data": " \n \n \n   M POORNIKA  \nGITHUB   LINKEDIN      +91\n  Profile  \n   \n   Motivated and skilled 4th year  Computer Science and Engineering  student with proficiency in Java  seeking opportunities to \nleverage my programming expertise and problem solving skills in a dynamic and innovative environment  \n \nEducation  \n  Vellore  Institute  of Technology   Vellore  India  Sep 20  Jul 24 \nBTech  in Computer  Science  Engineering   CGPA  877/10  Till 6th sem  \nNarayana  Junior  College  India  May 20 \nAPBIE  Board  Class  XII Aggregate  954 % \nBharatiya  Vidya  Bhavan’s  India  May 18 \nCBSE  Board  Class  X Aggregate  944 % \n \nWork  Experience  \n \nInnovator’s  Quest   Marketing  Head   India  Jan 22  Jan 23 \n Successfully  organized  multiple  hackathons  and other  events  including  securing  sponsorships  coordinating  \nwith vendors  and managing  logistics Developed  and executed  innovative  marketing  strategies  to increase  \nattendance  and engagement  at events  resulting  in a significant  increase  in participation  year over year  \nYHills   Front End Developer  Intern   India  Jul 22  Sep 22 \n Demonstrated  proficiency  in developing  responsive  and visually  appealing  portfolios  and ecommerce  websites  \nusing  HTML  CSS  JavaScript  and other  front end technologies  \n \n  Coordinator at Rivie ra and Gravitas   India  \n I actively participated in extracurricular activities such as organizing and being a part of cultur al and technical  fests \nlike Riviera and Gravitas which allowed me to develop leadership  teamwork  and event management abilities      \nPersonal and Academic Projects  \n \nProtection  of Medical  Data  using  Cryptosystems   LINK   GITHUB  Aug 22  Aug 22 \n Led a project  focused  on protecting  patient  privacy  by developing  a secure  approach  to analyzing  medical  \ndata Utilized  multiple  data servers  and advanced  cryptography  techniques  such  as the Paillier  and ElGamal  \ncryptosystems  to securely  store  and analyze  patient  data while  maintaining  confidentiality  \n \nSmart  Transactions  using  Ethereum   LINK   GITHUB    Feb 23  May 22 \n Implemented  smart  transaction  and information  storage  features  on the Ethereum  blockchain  leveraging  \ncutting edge technologies to create a highly functional and effective blockchain system  Designed an intuitive \nand accessible user interface for the system using the Streamlit module in Python and deployed the application \non the  Streamlit  cloud  for easy  access  and usage  \n \nChronic Kidney Disease Prediction Using ML Techniques  Jan 23  April  23 \n Develop ed a machine learning model for early Chronic Kidney Disease CKD prediction  enabl ing timely \nintervention  and preventing or delaying end stage renal failure  and reducing CKD's global health impact  \n \nCertificates  \n  SC900 Microsoft Security Compliance and Identity Fundamentals                                             May 23  July 23 \nSkills  \n \nTechnical  Skills  Java   MySQL   HTML5   Python   Data  Structures   Algorithms   Git  Github   Google Cloud   Computer  \nNetworking   Cyber  Security  Blockchain    \nSoft Skills  Leader   Motivator   Initiator   Team  player   Public  speaker   Analytical  thinking   Problem solving   Hard Worker  \n \n  Achievements  \n Finalist in inCode’23 Hackathon  conducted by inDrive  ",
  "emails": [
    "poornika2919@gmail.com"
  ],
  "entities": [
    "APBIE  Board",
    "India",
    "YHills   Front End Developer  Intern",
    "Riviera",
    "CGPA",
    "CSS",
    "Paillier",
    "CBSE",
    "Computer  Science  Engineering",
    "Gravitas",
    "Ethereum",
    "XII Aggregate",
    "Computer Science and Engineering",
    "BTech",
    "Narayana  Junior  College",
    "Skills  \n \nTechnical  Skills",
    "Vellore  Institute  of Technology",
    "CKD",
    "Cryptosystems",
    "Board",
    "Bharatiya  Vidya  Bhavan’s"
  ],
  "experience": "Education  \n   Vellore   Institute   of Technology    Vellore   India   Sep 20   Jul 24 \n BTech   in Computer   Science   Engineering    CGPA   877/10   Till 6th sem  \n Narayana   Junior   College   India   May 20 \n APBIE   Board   Class   XII Aggregate   954 % \n Bharatiya   Vidya   Bhavan ’s   India   May 18 \n CBSE   Board   Class   X Aggregate   944 % \n \n Work   Experience  \n \n Innovator ’s   Quest    Marketing   Head    India   Jan 22   Jan 23 \n  Successfully   organized   multiple   hackathons   and other   events   including   securing   sponsorships   coordinating  \n with vendors   and managing   logistics Developed   and executed   innovative   marketing   strategies   to increase  \n attendance   and engagement   at events   resulting   in a significant   increase   in participation   year over year  \n YHills    Front End Developer   Intern    India   Jul 22   Sep 22 \n  Demonstrated   proficiency   in developing   responsive   and visually   appealing   portfolios   and ecommerce   websites  \n using   HTML   CSS   JavaScript   and other   front end technologies  \n \n   Coordinator at Rivie ra and Gravitas    India  \n  I actively participated in extracurricular activities such as organizing and being a part of cultur al and technical   fests \n like Riviera and Gravitas which allowed me to develop leadership   teamwork   and event management abilities      \n Personal and Academic Projects  \n \n Protection   of Medical   Data   using   Cryptosystems    LINK    GITHUB   Aug 22   Aug 22 \n  Led a project   focused   on protecting   patient   privacy   by developing   a secure   approach   to analyzing   medical  \n data Utilized   multiple   data servers   and advanced   cryptography   techniques   such   as the Paillier   and ElGamal  \n cryptosystems   to securely   store   and analyze   patient   data while   maintaining   confidentiality  \n \n Smart   Transactions   using   Ethereum    LINK    GITHUB     Feb 23   May 22 \n  Implemented   smart   transaction   and information   storage   features   on the Ethereum   blockchain   leveraging  \n cutting edge technologies to create a highly functional and effective blockchain system   Designed an intuitive \n and accessible user interface for the system using the Streamlit module in Python and deployed the application \n on the   Streamlit   cloud   for easy   access   and usage  \n \n Chronic Kidney Disease Prediction Using ML Techniques   Jan 23   April   23 \n  Develop ed a machine learning model for early Chronic Kidney Disease CKD prediction   enabl ing timely \n intervention   and preventing or delaying end stage renal failure   and reducing CKD 's global health impact  \n \n Certificates  \n   SC900 Microsoft Security Compliance and Identity Fundamentals                                              May 23   July 23 \n Skills  \n \n Technical   Skills   Java    MySQL    HTML5    Python    Data   Structures    Algorithms    Git   Github    Google Cloud    Computer  \n Networking    Cyber   Security   Blockchain    \n Soft Skills   Leader    Motivator    Initiator    Team   player    Public   speaker    Analytical   thinking    Problem solving    Hard Worker  \n \n   Achievements  \n  Finalist in inCode’23 Hackathon   conducted by inDrive  ",
  "extracted_keywords": [
    "M",
    "POORNIKA",
    "GITHUB",
    "LINKEDIN",
    "Profile",
    "year",
    "Computer",
    "Science",
    "Engineering",
    "student",
    "proficiency",
    "Java",
    "opportunities",
    "programming",
    "expertise",
    "problem",
    "skills",
    "environment",
    "Education",
    "Vellore",
    "Institute",
    "Technology",
    "Vellore",
    "India",
    "Sep",
    "Jul",
    "BTech",
    "Computer",
    "Science",
    "Engineering",
    "877/10",
    "sem",
    "Narayana",
    "Junior",
    "College",
    "India",
    "May",
    "APBIE",
    "Board",
    "Class",
    "XII",
    "Aggregate",
    "%",
    "Bharatiya",
    "Vidya",
    "Bhavan",
    "India",
    "May",
    "CBSE",
    "Board",
    "Class",
    "X",
    "Aggregate",
    "%",
    "Work",
    "Experience",
    "Innovator",
    "Quest",
    "Marketing",
    "Head",
    "India",
    "Jan",
    "Jan",
    "hackathons",
    "events",
    "sponsorships",
    "vendors",
    "logistics",
    "marketing",
    "strategies",
    "attendance",
    "events",
    "increase",
    "participation",
    "year",
    "year",
    "YHills",
    "End",
    "Developer",
    "Intern",
    "India",
    "Jul",
    "Sep",
    "proficiency",
    "portfolios",
    "websites",
    "HTML",
    "CSS",
    "JavaScript",
    "end",
    "technologies",
    "Coordinator",
    "Rivie",
    "ra",
    "Gravitas",
    "India",
    "activities",
    "part",
    "cultur",
    "al",
    "fests",
    "Riviera",
    "Gravitas",
    "leadership",
    "teamwork",
    "event",
    "management",
    "abilities",
    "Personal",
    "Academic",
    "Projects",
    "Protection",
    "Medical",
    "Data",
    "Cryptosystems",
    "LINK",
    "GITHUB",
    "Aug",
    "Aug",
    "project",
    "privacy",
    "approach",
    "data",
    "data",
    "servers",
    "cryptography",
    "techniques",
    "Paillier",
    "ElGamal",
    "cryptosystems",
    "store",
    "data",
    "confidentiality",
    "Smart",
    "Transactions",
    "Ethereum",
    "LINK",
    "GITHUB",
    "Feb",
    "May",
    "transaction",
    "information",
    "storage",
    "Ethereum",
    "edge",
    "technologies",
    "system",
    "user",
    "interface",
    "system",
    "Streamlit",
    "module",
    "Python",
    "application",
    "Streamlit",
    "cloud",
    "access",
    "usage",
    "Chronic",
    "Kidney",
    "Disease",
    "Prediction",
    "ML",
    "Techniques",
    "Jan",
    "April",
    "Develop",
    "ed",
    "machine",
    "learning",
    "model",
    "Chronic",
    "Kidney",
    "Disease",
    "CKD",
    "prediction",
    "ing",
    "intervention",
    "end",
    "stage",
    "failure",
    "CKD",
    "health",
    "impact",
    "Certificates",
    "SC900",
    "Microsoft",
    "Security",
    "Compliance",
    "Identity",
    "Fundamentals",
    "May",
    "July",
    "Skills",
    "Technical",
    "Skills",
    "Java",
    "MySQL",
    "HTML5",
    "Python",
    "Data",
    "Structures",
    "Algorithms",
    "Git",
    "Github",
    "Google",
    "Cloud",
    "Computer",
    "Networking",
    "Cyber",
    "Security",
    "Blockchain",
    "Soft",
    "Skills",
    "Leader",
    "Motivator",
    "Initiator",
    "Team",
    "player",
    "speaker",
    "Analytical",
    "Problem",
    "Hard",
    "Worker",
    "Achievements",
    "Finalist",
    "Hackathon"
  ],
  "keyterms": [
    [
      "India",
      0.07579700076170019
    ],
    [
      "GITHUB",
      0.05145071769407465
    ],
    [
      "year",
      0.04255442647556069
    ],
    [
      "Computer",
      0.03986170980609217
    ],
    [
      "proficiency",
      0.03122692148588871
    ],
    [
      "Chronic Kidney Disease",
      0.02718220277661149
    ],
    [
      "Science",
      0.02574466921986232
    ],
    [
      "Engineering",
      0.0246656395102078
    ],
    [
      "innovative",
      0.024634373460502176
    ],
    [
      "Sep",
      0.02397345388186827
    ],
    [
      "Jul",
      0.023761626271099966
    ],
    [
      "Jan",
      0.02101548529510715
    ],
    [
      "event",
      0.01929107363989445
    ],
    [
      "problem",
      0.0188497942774904
    ],
    [
      "skill",
      0.01593957062225165
    ],
    [
      "Board",
      0.015514253148287319
    ],
    [
      "Class",
      0.01518304949790305
    ],
    [
      "multiple",
      0.014691521622899967
    ],
    [
      "Aggregate",
      0.014687453497809637
    ],
    [
      "Vellore",
      0.013011175141493046
    ]
  ],
  "name": [],
  "phones": [],
  "resume_data": " \n \n \n   M POORNIKA  \nGITHUB  | LINKEDIN  | poornika2919@gmail.com  | +91-8179097557\n  Profile  \n   \n   Motivated and skilled 4th year  Computer Science and Engineering  student with proficiency in Java,  seeking opportunities to \nleverage my programming expertise and problem -solving skills in a dynamic and innovative environment . \n \nEducation  \n  Vellore  Institute  of Technology  - Vellore,  India  Sep 20 - Jul 24 \nBTech  in Computer  Science  Engineering  | CGPA:  8.77/10  (Till 6th sem)  \nNarayana  Junior  College,  India  May 20 \nAPBIE  Board  (Class  XII), Aggregate:  95.4 % \nBharatiya  Vidya  Bhavan’s,  India  May 18 \nCBSE  Board  (Class  X), Aggregate:  94.4 % \n \nWork  Experience  \n \nInnovator’s  Quest  | Marketing  Head  | India  Jan 22 - Jan 23 \n Successfully  organized  multiple  hackathons  and other  events,  including  securing  sponsorships , coordinating  \nwith vendors,  and managing  logistics .Developed  and executed  innovative  marketing  strategies  to increase  \nattendance  and engagement  at events , resulting  in a significant  increase  in participation  year over year.  \nYHills  | Front -End Developer  (Intern)  | India  Jul 22 - Sep 22 \n Demonstrated  proficiency  in developing  responsive  and visually  appealing  portfolios  and e-commerce  websites  \nusing  HTML,  CSS,  JavaScript,  and other  front -end technologies.  \n \n  Coordinator at Rivie ra and Gravitas  | India  \n I actively participated in extracurricular activities, such as organizing and being a part of cultur al and technical  fests \nlike Riviera and Gravitas, which allowed me to develop leadership , teamwork , and event management abilities .     \nPersonal and Academic Projects  \n \nProtection  of Medical  Data  using  Cryptosystems  | LINK  | GITHUB  Aug 22 - Aug 22 \n Led a project  focused  on protecting  patient  privacy  by developing  a secure  approach  to analyzing  medical  \ndata. Utilized  multiple  data servers  and advanced  cryptography  techniques , such  as the Paillier  and ElGamal  \ncryptosystems , to securely  store  and analyze  patient  data while  maintaining  confidentiality . \n \nSmart  Transactions  using  Ethereum  | LINK  | GITHUB    Feb 23 - May 22 \n Implemented  smart  transaction  and information  storage  features  on the Ethereum  blockchain , leveraging  \ncutting -edge technologies to create a highly functional and effective blockchain system . Designed an intuitive \nand accessible user interface for the system using the Streamlit module in Python and deployed the application \non the  Streamlit  cloud  for easy  access  and usage.  \n \nChronic Kidney Disease Prediction Using ML Techniques  Jan 23 - April  23 \n Develop ed a machine learning model for early Chronic Kidney Disease (CKD) prediction  enabl ing timely \nintervention , and preventing or delaying end -stage renal failure  and reducing CKD's global health impact . \n \nCertificates  \n  SC-900, Microsoft Security, Compliance, and Identity Fundamentals                                             May 23 - July 23 \nSkills  \n \nTechnical  Skills:  Java  | MySQL  | HTML5  | Python |  Data  Structures  | Algorithms  | Git | Github  | Google Cloud  | Computer  \nNetworking  | Cyber  Security|  Blockchain  |  \nSoft Skills:  Leader  | Motivator  | Initiator  | Team  player  | Public  speaker  | Analytical  thinking  | Problem -solving  | Hard Worker  \n \n  Achievements  \n Finalist in inCode’23 Hackathon  conducted by inDrive  ",
  "tri_grams": "[Motivated and skilled, Science and Engineering, student with proficiency, proficiency in Java, leverage my programming, expertise and problem, problem solving skills, dynamic and innovative, year over year, Coordinator at Rivie, ra and Gravitas, participated in extracurricular, al and technical, Riviera and Gravitas, Gravitas which allowed, event management abilities, Personal and Academic, Led a project, cutting edge technologies, technologies to create, create a highly, functional and effective, effective blockchain system, Designed an intuitive, accessible user interface, module in Python, Python and deployed, deployed the application, Chronic Kidney Disease, Kidney Disease Prediction, Prediction Using ML, ed a machine, machine learning model, model for early, early Chronic Kidney, Chronic Kidney Disease, Kidney Disease CKD, Disease CKD prediction, enabl ing timely, preventing or delaying, delaying end stage, end stage renal, stage renal failure, CKD's global, global health impact, SC900 Microsoft Security, Microsoft Security Compliance, Compliance and Identity, Finalist in inCode’23, conducted by inDrive]",
  "unique_id": "d86be101-540b-46a9-b9da-9940b004996d",
  "years": [],
  "score": 468.13858188153307,
  "jobId": "AXIS171668",
  "emailBody": "Dear candidate,\n\nCongratulations on selecting a video interview for the Software Engineer position at Hair. We are excited to learn more about you and your skills.\n\nPlease record a video response for each of the following questions. Your responses should not exceed 1 minute each.\n\n1. Tell us about yourself and why you are interested in working at Hair.\n2. What are your strengths and weaknesses as a software engineer?\n3. Describe a project you have worked on that you are proud of.\n4. What are your salary expectations?\n5. What are your availability and start date?\n\nYou can upload your videos to the following link: http://localhost:3001/firstRoundInterview\n\nPlease include your candidate ID (d86be101-540b-46a9-b9da-9940b004996d) in the filename of each video.\n\nWe look forward to hearing from you!\n\nSincerely,\n\nhAIr",
  "videoAnalysis": {
    "result": {
      "output": 85.5
    },
    "videoAnalysis": [
      {
        "label": {
          "Angry": 0.9070294784580499,
          "Happy": 19.727891156462583,
          "Neutral": 14.512471655328799,
          "Sad": 9.523809523809524,
          "Surprise": 0
        },
        "processed": 441,
        "frames": 441
      },
      {
        "label": {
          "Angry": 0.13386880856760375,
          "Happy": 5.756358768406962,
          "Neutral": 29.049531459170012,
          "Sad": 4.28380187416332,
          "Surprise": 0
        },
        "processed": 747,
        "frames": 747
      },
      {
        "label": {
          "Angry": 0,
          "Happy": 7.3131955484896665,
          "Neutral": 64.94435612082671,
          "Sad": 2.305246422893482,
          "Surprise": 0
        },
        "processed": 1258,
        "frames": 1258
      },
      {
        "label": {
          "Angry": 1.3227513227513228,
          "Happy": 21.03174603174603,
          "Neutral": 41.66666666666667,
          "Sad": 6.216931216931217,
          "Surprise": 0
        },
        "processed": 756,
        "frames": 756
      }
    ],
    "audioAnalysis": [
      "Well, my biggest strength in software engineer is already said I can solve any problem with the power of machine learning. And my biggest weakness is that I am very bad at designing the architecture of a whole application. As such.",
      "Okay, now, trying to answer the third question. Well, my salary expectations are not really that heavy. I would just expect somewhere around 20 or 25 LPA. And I'll tell you why. Because I have almost two to three years of intense experience in solving real world problems with machine learning. So not really over frugal about my salary.",
      "Hello. Okay, well, I'm trying to answer the first question. So why my machine learning experience has been really good. So mostly my experience comes from participating in Hackathons, where I would love to solve really good problems with machine learning. And more than that, my strength is that I can literally solve any problem with machine learning and I can think of any kind of application machine learning in any domain. And my weakness is that I spend a lot of time on RND where I mess up with the actual algorithm, which I'm thinking for, to choose for that particular problem. So this, in fact, reduces the accuracy and other parameters of a machine learning algorithm.",
      "Well, why I want to work with Hair is that yeah, Hair has a really good, amazing opportunity where, for software engineers, like, you know well so software engineers are really paid off well, and you actually get to solve the problems which impact other people's life."
    ]
  }
},
{
  "_id": {
    "$oid": "64f94c78956ee4dc69e785ea"
  },
  "bi_grams": "[Subhanu Sankar, Sankar Roy, | www, www linkedincom, in/ subhanusroy, Vellore Institute, Nadu India, Expected Graduation, Graduation June, Information Technology, Computer Languages, Javascript Typescript, Typescript C, Java Python, HTML CSS, Frontend Development, Machine Learning, Cloud Practioner, Practioner Certified, FastAPI NextJS, Tailwind CSS, Pandas Tensorflow, GitHub Jira, Data Structures, C++ solved, + quality, quality problems, Leetcod e, MongoDb SQL, SQL PostgresSQL, PostgresSQL SQLite, SQLite Firebase, Computer Fundamentals, Fundamentals object, object oriented, oriented design, design algorithm, algorithm design, problem solving, operati ng, ng systems, systems netw, netw orking, WORK EXPERIENCE, Software Development, Development Intern, TIFAC Lab, Lab VIT, Prese nt, Remote India, Vellore Tamil, Tamil Nadu, Nadu India, production level, level commercial, commercial projects, VIT takes, clients including, including hospitals, hospitals clinics, clinics etc, fledged management, management system, multiple models, Redux ReactJS, Implementing clean, clean coding, folder structure, mainta ining, ining servers, servers CI, CD pipeline, Software Engineer, Engineer Intern, Remote India, production level, level SaaS, SaaS analytics, analytics tool, tool collaborating, Product Manager, Redux ReactJS, NodeTS Express, Express Prisma, Writing clean, easily maintainable, maintainable code, relia bility, prototyping tools, Cyber Security, Security Product, Product Developer, Developer Intern, SecLogic Ltd, flagship product, product ORO, production level, level issues, fixing bugs, reduced loading, loading time, different JS, JS libraries, like Amcharts, Amcharts Material, Material UI, UI etc, improved code, code structure, Technical Head, VITrendz Student, Student Community, Tamil Nadu, entire life, life cycle, design till, Exponentially increasing, increasing revenue, revenue generation, strategic placement, Lead developer, flagship project, FFCS Planner, 15k+ college, college students, PROJECT S, PhysioPlus Efficient, Efficient Patient, Patient Management, Management System, Micro Clinics, user friendly, friendly dashboard, dashboard UI, + attributes, + patients, multi user, user editable, editable assessment, assessment system, plotted pain, pain scale, scale graphs, real time, time dynamic, dynamic updates, patient details, treatment trackers, downloadable discharge, discharge summaries, payment receipts, Conversational AI, AI Port, Port al, create jobs, jobs courses, courses sessions, User types, types Seeker, voice recognition, powered AI, find courses, courses jobs, jobs mentors, AI creates, job posting, posting course, course structure, structure mentor, mentor description, details given, React React, React Redux, Redux State, State Management, Management React, React Router, Tailwind CSS, Framer Motion, Fully Flexible, Flexible Credit, Credit System, System Planner, single page, page web, web app, React JS, handle 3k+, 3k+ concurrent, 30k+ students, Helps VITians, choosing desired, desired course, course faculty, faculty time, possible timetables, chosen courses, 3D pathfinding, pathfinding algorithm, web app, gesture recognition, speech totext, totext ML, ML models, recognized gestures, voice instantly, instantly generated, desired gender, gesture recognition, recognition model, Bajaj Finserv, + teams, IEEE Women, Engineering hackathon, hackathon WeHack, Honeywell Team, + teams, SAWO Labs, Labs Track, Track winner, + students, Samsung Solve, Finali sts, 1Hack 4Sustai, 4Sustai nability, + Teams, Healthineers SHIFT, SHIFT hackathon]",
  "clean_data": "Subhanu Sankar Roy  \n+91  |   | / SubhanuSRoy  | www linkedincom/in/ subhanusroy  \n \nEDUCATION  \nVellore Institute of Technology  Vellore  Tamil  Nadu India  Expected Graduation June 2024 \nBachelor of Technology  Information Technology  \nSKILLS  \n Computer Languages   Javascript Typescript C/C++  Java Python  HTML CSS  \n Most experienced   Full Stack  Development  Frontend Development  Machine Learning  AWS  Cloud Practioner Certified  \n Frameworks   ReactJS  Redux  Django  FastAPI NextJS  Tailwind CSS  Numpy  Pandas Tensorflow  GitHub Jira  Slack  \n Data Structures & Algorithms  in C++ solved 200+ quality problems on Leetcod e 140 0+ on Codechef  \n Databases  MongoDb SQL PostgresSQL SQLite Firebase  \n Computer Fundamentals object oriented design algorithm design  problem solving  operati ng systems netw orking  \n \n \nWORK EXPERIENCE  \nSoftware Development Intern   TIFAC Lab VIT   April 2023  Prese nt \nRemote India  and Vellore Tamil Nadu India  \n Designing and developing  production level commercial projects which VIT takes with clients including hospitals clinics etc  \n Developing a full fledged management system with CRUD of multiple models  using Redux ReactJS and TailwindCSS  \n Implementing clean coding  practices  and folder structure  mainta ining servers CI/CD pipeline using Git  \nSoftware Engineer Intern   Quinn   May 2023  June 2023  \nRemote India  \n Designing  and developing  a data  production level SaaS analytics tool collaborating with Product Manager  \n Developing the frontend using Redux ReactJS and TailwindCSS  and backend using NodeTS Express Prisma  \n Writing clean and easily maintainable code  with a focus on relia bility and scalability  using editor and prototyping tools  \nCyber Security Product Developer Intern  SecLogic Ltd  May 2021  Feb 2022  \nRemote  India  \n Developed  the front end of one of their flagship product ORO in ReactJS as per UI on Figma  \n Worked on production level issues  and fixing bugs which reduced loading time by 20%  \n Learning and working with different JS libraries  like Amcharts Material UI etc which improved code structure  and quality  \nTechnical Head  VITrendz Student Community  Largest in VIT  March  2021  Aug 2022  \nVellore  Tamil Nadu  India  \n Managing the entire life cycle of all the projects  made on vitrendzcom from the design till the marketing  \n Exponentially increasing revenue generation through strategic placement of ads on services  \n Lead developer of flagship project  FFCS Planner which is used every semester by 15k+ college students   \n \n \nTOP PROJECT S  \nPhysioPlus Efficient Patient Management System for Micro Clinics    plusnetlifyapp/  July 2023 \n Developed  a user friendly dashboard UI for displaying 216+ attributes  per patient for 300+ patients  over 2 clinics  \n Programmed a multi user editable assessment system  with plotted pain scale graphs  and real time dynamic updates  \n Consolidated  patient details  treatment trackers  with downloadable discharge summaries  and payment receipts  \n \nSkillEase  Conversational AI Port al to find/create jobs courses sessions      February 2023 \n 2 User types Seeker can converse using voice recognition  with GPT 35 powered AI  to find courses jobs mentors  \n AI creates the job posting course structure mentor description  from details given by Contributor in just 1 click  \n Made using React React Redux State Management React Router  Tailwind CSS  Framer Motion  \n \nFully Flexible Credit System Planner     subhanunetlifyapp/  November 2021 \n A single page web app  made in React JS and TailwindCSS  optimized to handle 3k+ concurrent  users on site  \n Overall used by 30k+ students  in college  Helps VITians make their timetable by choosing desired course faculty time  \n USP  feature that generates all possible timetables  as per chosen courses and time using a 3D pathfinding algorithm   \n \nVokal  Helping the mute to speak   /  October  2021 \n A web app that combines the powers of gesture recognition and speech totext ML models  \n Anyone can use any of the recognized gestures  and get their own voice instantly generated  in their desired gender   \n Built using ReactJS  Tailwind  and gesture recognition model made using TensorflowJS  \nACHIEVEMENTS  \n HackRx 30 National First Runner Up organised by Bajaj Finserv  out of 1000+ teams  Team of 2  \n Winner  of IEEE Women In Engineering hackathon WeHack 2022 powered by Honeywell Team of 2  out of 500+ teams  \n SAWO Labs Track winner  at Hack This Fall 2021  out of 4500+ students  \n Qualified in Top 50 out of 18000+  applications in Samsung Solve For  Tomorrow 2022  \n Top 5 Finali sts in Amadues  1Hack 4Sustai nability 2022 Te am of 2  \n Finalist  Top 10 out of 3000+ Teams  at Siemens  Healthineers SHIFT hackathon  2022  Team  of 2 \n",
  "emails": [
    "subhanu12@gmail.com"
  ],
  "entities": [
    "Git  \nSoftware Engineer Intern",
    "Remote India",
    "Tailwind CSS",
    "ORO",
    "SQLite Firebase",
    "Learning",
    "IEEE Women In Engineering",
    "India",
    "SKILLS",
    "GPT",
    "JS",
    "SAWO Labs Track",
    "Expected Graduation",
    "Leetcod",
    "VITrendz Student Community  Largest",
    "Vellore Institute of Technology  Vellore  Tamil  ",
    "C++",
    "Siemens  Healthineers",
    "VITians",
    "Honeywell Team",
    "Efficient Patient Management System",
    "Computer Languages",
    "Data Structures & Algorithms",
    "Consolidated",
    "React JS",
    "Team of 2",
    "Redux State Management React Router",
    "operati ng",
    "Redux  Django",
    "Express Prisma",
    "Amadues",
    "WeHack 2022",
    "CRUD",
    "VIT",
    "Designing",
    "ML",
    "Computer Fundamentals",
    "AI",
    "Bachelor of Technology  Information Technology",
    "Figma",
    "TailwindCSS"
  ],
  "experience": "",
  "extracted_keywords": [
    "Subhanu",
    "Sankar",
    "Roy",
    "|",
    "|",
    "SubhanuSRoy",
    "|",
    "www",
    "linkedincom",
    "in/",
    "EDUCATION",
    "Vellore",
    "Institute",
    "Technology",
    "Vellore",
    "Tamil",
    "Nadu",
    "India",
    "Graduation",
    "June",
    "Bachelor",
    "Technology",
    "Information",
    "Technology",
    "SKILLS",
    "Computer",
    "Languages",
    "Javascript",
    "Typescript",
    "C",
    "C++",
    "Java",
    "Python",
    "HTML",
    "CSS",
    "Full",
    "Stack",
    "Development",
    "Frontend",
    "Development",
    "Machine",
    "Learning",
    "AWS",
    "Cloud",
    "Practioner",
    "Frameworks",
    "ReactJS",
    "Redux",
    "Django",
    "FastAPI",
    "NextJS",
    "Tailwind",
    "CSS",
    "Numpy",
    "Pandas",
    "Tensorflow",
    "GitHub",
    "Jira",
    "Slack",
    "Data",
    "Structures",
    "Algorithms",
    "C++",
    "quality",
    "problems",
    "Leetcod",
    "e",
    "Codechef",
    "Databases",
    "SQL",
    "PostgresSQL",
    "SQLite",
    "Firebase",
    "Computer",
    "Fundamentals",
    "design",
    "algorithm",
    "design",
    "problem",
    "operati",
    "ng",
    "systems",
    "netw",
    "WORK",
    "EXPERIENCE",
    "Software",
    "Development",
    "Intern",
    "TIFAC",
    "Lab",
    "VIT",
    "April",
    "Remote",
    "India",
    "Vellore",
    "Tamil",
    "Nadu",
    "India",
    "Designing",
    "production",
    "level",
    "projects",
    "VIT",
    "clients",
    "hospitals",
    "clinics",
    "management",
    "system",
    "CRUD",
    "models",
    "Redux",
    "ReactJS",
    "TailwindCSS",
    "practices",
    "folder",
    "structure",
    "mainta",
    "servers",
    "CI",
    "CD",
    "pipeline",
    "Git",
    "Software",
    "Engineer",
    "Intern",
    "Quinn",
    "May",
    "June",
    "Remote",
    "India",
    "Designing",
    "data",
    "production",
    "level",
    "SaaS",
    "analytics",
    "tool",
    "Product",
    "Manager",
    "frontend",
    "Redux",
    "ReactJS",
    "TailwindCSS",
    "NodeTS",
    "Express",
    "Prisma",
    "code",
    "focus",
    "relia",
    "bility",
    "scalability",
    "editor",
    "tools",
    "Cyber",
    "Security",
    "Product",
    "Developer",
    "Intern",
    "SecLogic",
    "Ltd",
    "May",
    "Feb",
    "Remote",
    "India",
    "end",
    "flagship",
    "product",
    "ORO",
    "ReactJS",
    "UI",
    "Figma",
    "production",
    "level",
    "issues",
    "bugs",
    "loading",
    "time",
    "%",
    "Learning",
    "JS",
    "libraries",
    "Amcharts",
    "Material",
    "UI",
    "code",
    "structure",
    "quality",
    "Technical",
    "Head",
    "VITrendz",
    "Student",
    "Community",
    "Largest",
    "VIT",
    "March",
    "Aug",
    "Vellore",
    "Tamil",
    "Nadu",
    "India",
    "life",
    "cycle",
    "projects",
    "vitrendzcom",
    "design",
    "marketing",
    "revenue",
    "generation",
    "placement",
    "ads",
    "services",
    "Lead",
    "developer",
    "flagship",
    "project",
    "FFCS",
    "Planner",
    "semester",
    "15k+",
    "college",
    "students",
    "TOP",
    "PROJECT",
    "S",
    "PhysioPlus",
    "Efficient",
    "Patient",
    "Management",
    "System",
    "Micro",
    "Clinics",
    "July",
    "user",
    "dashboard",
    "UI",
    "attributes",
    "patient",
    "patients",
    "clinics",
    "user",
    "assessment",
    "system",
    "pain",
    "scale",
    "graphs",
    "time",
    "updates",
    "details",
    "treatment",
    "trackers",
    "discharge",
    "summaries",
    "payment",
    "receipts",
    "SkillEase",
    "Conversational",
    "AI",
    "Port",
    "al",
    "jobs",
    "courses",
    "sessions",
    "February",
    "User",
    "types",
    "Seeker",
    "voice",
    "recognition",
    "GPT",
    "AI",
    "courses",
    "jobs",
    "mentors",
    "AI",
    "job",
    "course",
    "structure",
    "mentor",
    "description",
    "details",
    "Contributor",
    "React",
    "React",
    "Redux",
    "State",
    "Management",
    "React",
    "Router",
    "Tailwind",
    "CSS",
    "Framer",
    "Motion",
    "Flexible",
    "Credit",
    "System",
    "Planner",
    "November",
    "page",
    "web",
    "app",
    "React",
    "JS",
    "TailwindCSS",
    "users",
    "site",
    "Overall",
    "students",
    "college",
    "VITians",
    "timetable",
    "course",
    "faculty",
    "time",
    "USP",
    "feature",
    "timetables",
    "courses",
    "time",
    "3D",
    "algorithm",
    "Vokal",
    "mute",
    "October",
    "web",
    "app",
    "powers",
    "recognition",
    "speech",
    "ML",
    "models",
    "gestures",
    "voice",
    "gender",
    "ReactJS",
    "Tailwind",
    "recognition",
    "model",
    "TensorflowJS",
    "ACHIEVEMENTS",
    "National",
    "First",
    "Runner",
    "Bajaj",
    "Finserv",
    "teams",
    "Team",
    "Winner",
    "Women",
    "Engineering",
    "hackathon",
    "WeHack",
    "Honeywell",
    "Team",
    "teams",
    "SAWO",
    "Labs",
    "Track",
    "winner",
    "Hack",
    "Fall",
    "students",
    "Qualified",
    "Top",
    "applications",
    "Samsung",
    "Solve",
    "Tomorrow",
    "Top",
    "sts",
    "Amadues",
    "4Sustai",
    "nability",
    "Te",
    "am",
    "Finalist",
    "Top",
    "Teams",
    "Siemens",
    "Healthineers",
    "SHIFT",
    "hackathon",
    "Team"
  ],
  "keyterms": [
    [
      "Nadu India",
      0.12339298443844286
    ],
    [
      "production level",
      0.09161919097846043
    ],
    [
      "Remote India",
      0.078191693364175
    ],
    [
      "gesture recognition",
      0.06718972580205304
    ],
    [
      "Redux reactjs",
      0.06587275420156868
    ],
    [
      "Tamil Nadu",
      0.056079369585877586
    ],
    [
      "Tailwind CSS",
      0.055022136156644454
    ],
    [
      "Vellore",
      0.025091399792455876
    ],
    [
      "web app",
      0.016453896632437078
    ],
    [
      "Development",
      0.013246949100151454
    ],
    [
      "June",
      0.012991860326595413
    ],
    [
      "project",
      0.010547896318635125
    ],
    [
      "design",
      0.010404599558068469
    ],
    [
      "VIT",
      0.010093028898791673
    ],
    [
      "Intern",
      0.009968778862200456
    ],
    [
      "Learning",
      0.009889286706734128
    ],
    [
      "structure",
      0.009653922614644449
    ],
    [
      "Computer",
      0.009296111011009307
    ],
    [
      "C++",
      0.008744220832107418
    ],
    [
      "quality",
      0.008200758780783989
    ]
  ],
  "name": [
    "Sankar Roy"
  ],
  "phones": [],
  "resume_data": "Subhanu Sankar Roy  \n+91-9874972031  | subhanu12@gmail.com  | www.github.com/ SubhanuSRoy  | www. linkedin.com/in/ subhanusroy  \n \nEDUCATION  \nVellore Institute of Technology , Vellore,  Tamil  Nadu, India . Expected Graduation: June 2024 \nBachelor of Technology  Information Technology  \nSKILLS  \n• Computer Languages  – Javascript, Typescript, C/C++,  Java, Python,  HTML, CSS  \n• Most experienced  – Full Stack  Development , Frontend Development,  Machine Learning,  AWS  (Cloud Practioner Certified)  \n• Frameworks /Tools : ReactJS , Redux , Django,  FastAPI, NextJS , Tailwind CSS , Numpy , Pandas, Tensorflow,  GitHub, Jira , Slack  \n• Data Structures & Algorithms : in C++, solved 200+ quality problems on Leetcod e, 140 0+ on Codechef  \n• Databases : MongoDb, SQL, PostgresSQL, SQLite, Firebase  \n• Computer Fundamentals: object -oriented design, algorithm design , problem solving , operati ng systems, netw orking  \n \n \nWORK EXPERIENCE  \nSoftware Development Intern  – TIFAC Lab VIT   April 2023 – Prese nt \nRemote, India  and Vellore, Tamil Nadu, India  \n• Designing and developing  production level commercial projects which VIT takes with clients including hospitals, clinics etc  \n• Developing a full fledged management system with CRUD of multiple models  using Redux, ReactJS and TailwindCSS  \n• Implementing clean coding  practices  and folder structure , mainta ining servers, CI/CD pipeline using Git  \nSoftware Engineer Intern  – Quinn   May 2023 – June 2023  \nRemote, India  \n• Designing  and developing  a data -heavy, production level SaaS analytics tool, collaborating with Product Manager  \n• Developing the frontend using Redux, ReactJS and TailwindCSS  and backend using NodeTS, Express, Prisma.  \n• Writing clean and easily maintainable code  with a focus on relia bility and scalability  using editor and prototyping tools  \nCyber Security Product Developer Intern - SecLogic Ltd  May 2021 – Feb 2022  \nRemote , India  \n• Developed  the front -end of one of their flagship product ORO in ReactJS, as per UI on Figma  \n• Worked on production level issues  and fixing bugs, which reduced loading time by 20%  \n• Learning and working with different JS libraries  like Amcharts, Material UI, etc, which improved code structure  and quality.  \nTechnical Head – VITrendz Student Community , Largest in VIT  March  2021 – Aug 2022  \nVellore,  Tamil Nadu , India  \n• Managing the entire life cycle of all the projects  made on vitrendz.com, from the design till the marketing.  \n• Exponentially increasing revenue generation through strategic placement of ads on services.  \n• Lead developer of flagship project  FFCS Planner, which is used every semester by 15k+ college students .  \n \n \nTOP PROJECT S  \nPhysioPlus (Efficient Patient Management System for Micro Clinics)  – https://physio -plus.netlify.app/  July 2023 \n• Developed  a user -friendly dashboard UI for displaying 216+ attributes  per patient for 300+ patients  over 2 clinics  \n• Programmed a multi user editable assessment system  with plotted pain scale graphs , and real time dynamic updates  \n• Consolidated  patient details , treatment trackers  with downloadable discharge summaries  and payment receipts  \n \nSkillEase – Conversational AI Port al to find/create jobs, courses, sessions  -  https://skillease.netlify.app/register  February 2023 \n• 2 User types: Seeker can converse using voice recognition  with GPT 3.5 -powered AI  to find courses, jobs, mentors.  \n• AI creates the job posting, course structure, mentor description  from details given by Contributor, in just 1 click . \n• Made using React, React Redux (State Management), React Router , Tailwind CSS , Framer Motion  \n \nFully Flexible Credit System Planner  –  https://ffcs -subhanu.netlify.app/  November 2021 \n• A single page web app  made in React JS and TailwindCSS , optimized to handle 3k+ concurrent  users on site.  \n• Overall used by 30k+ students  in college.  Helps VITians make their timetable by choosing desired course, faculty, time.  \n• USP - feature that generates all possible timetables  as per chosen courses and time, using a 3D pathfinding algorithm .  \n \nVokal - Helping the mute to speak  - https://vokal.netlify.app/  October  2021 \n• A web app that combines the powers of gesture recognition and speech -to-text ML models.  \n• Anyone can use any of the recognized gestures  and get their own voice instantly generated  in their desired gender .  \n• Built using ReactJS , Tailwind  and gesture recognition model made using TensorflowJS .. \nACHIEVEMENTS  \n• HackRx 3.0 National First Runner Up organised by Bajaj Finserv , out of 1000+ teams  (Team of 2)  \n• Winner  of IEEE -Women In Engineering hackathon WeHack 2022 powered by Honeywell (Team of 2)  out of 500+ teams  \n• SAWO Labs Track winner  at Hack This Fall 2021  out of 4500+ students.  \n• Qualified in Top 50 out of 18,000+  applications in Samsung Solve For  Tomorrow 2022  \n• Top 5 Finali sts in Amadues  1Hack 4Sustai nability 2022 (Te am of 2)  \n• Finalist  (Top 10 out of 3000+ Teams ) at Siemens  Healthineers SHIFT hackathon – 2022  (Team  of 2) \n",
  "tri_grams": "[Subhanu Sankar Roy, | www linkedincom, Institute of Technology, Expected Graduation June, Bachelor of Technology, Javascript Typescript C, Cloud Practioner Certified, + quality problems, problems on Leetcod, + on Codechef, MongoDb SQL PostgresSQL, SQL PostgresSQL SQLite, PostgresSQL SQLite Firebase, Computer Fundamentals object, Fundamentals object oriented, object oriented design, oriented design algorithm, design algorithm design, operati ng systems, ng systems netw, systems netw orking, Software Development Intern, TIFAC Lab VIT, Vellore Tamil Nadu, Tamil Nadu India, Designing and developing, production level commercial, level commercial projects, projects which VIT, takes with clients, clients including hospitals, including hospitals clinics, hospitals clinics etc, fledged management system, system with CRUD, CRUD of multiple, ReactJS and TailwindCSS, Implementing clean coding, mainta ining servers, ining servers CI, pipeline using Git, Software Engineer Intern, production level SaaS, level SaaS analytics, SaaS analytics tool, analytics tool collaborating, collaborating with Product, Developing the frontend, frontend using Redux, ReactJS and TailwindCSS, backend using NodeTS, NodeTS Express Prisma, clean and easily, easily maintainable code, focus on relia, bility and scalability, editor and prototyping, Cyber Security Product, Security Product Developer, Product Developer Intern, flagship product ORO, ORO in ReactJS, UI on Figma, Worked on production, production level issues, bugs which reduced, reduced loading time, Learning and working, working with different, different JS libraries, like Amcharts Material, Amcharts Material UI, Material UI etc, etc which improved, improved code structure, VITrendz Student Community, Largest in VIT, Managing the entire, entire life cycle, till the marketing, Exponentially increasing revenue, increasing revenue generation, generation through strategic, placement of ads, ads on services, developer of flagship, semester by 15k+, 15k+ college students, PhysioPlus Efficient Patient, Efficient Patient Management, Patient Management System, System for Micro, user friendly dashboard, friendly dashboard UI, UI for displaying, Programmed a multi, multi user editable, user editable assessment, editable assessment system, plotted pain scale, pain scale graphs, real time dynamic, time dynamic updates, downloadable discharge summaries, Conversational AI Port, AI Port al, al to find, create jobs courses, jobs courses sessions, User types Seeker, Seeker can converse, converse using voice, find courses jobs, courses jobs mentors, creates the job, job posting course, posting course structure, course structure mentor, structure mentor description, given by Contributor, React React Redux, React Redux State, Redux State Management, State Management React, Management React Router, Fully Flexible Credit, Flexible Credit System, Credit System Planner, single page web, page web app, JS and TailwindCSS, optimized to handle, handle 3k+ concurrent, users on site, timetable by choosing, choosing desired course, desired course faculty, course faculty time, feature that generates, generates all possible, courses and time, 3D pathfinding algorithm, Helping the mute, mute to speak, app that combines, combines the powers, powers of gesture, recognition and speech, speech totext ML, totext ML models, voice instantly generated, Built using ReactJS, gesture recognition model, Runner Up organised, organised by Bajaj, Women In Engineering, Engineering hackathon WeHack, powered by Honeywell, SAWO Labs Track, Labs Track winner, Hack This Fall, applications in Samsung, sts in Amadues, 1Hack 4Sustai nability, Healthineers SHIFT hackathon]",
  "unique_id": "671148a9-9c4f-448f-945a-ba8606af96b0",
  "years": [],
  "score": 366.46997254536996,
  "jobId": "AXIS171668",
  "emailBody": "Dear candidate,\n\nCongratulations on selecting a video interview for the Software Engineer position at our company! We are excited to learn more about you and your skills.\n\nPlease record a video response to each of the following questions. Your responses should be no more than 1 minute each.\n\n1. Tell us about your experience with ReactJS.\n2. What are your favorite features of ReactJS?\n3. What are some of the challenges you have faced with ReactJS?\n4. How do you stay up-to-date on the latest ReactJS news and developments?\n5. What are your salary expectations?\n\nPlease upload your videos to the following link: http://localhost:3001/firstRoundInterview\n\nYour candidate ID is 671148a9-9c4f-448f-945a-ba8606af96b0.\n\nWe look forward to hearing from you!\n\nSincerely,\nhAIr",
  "videoAnalysis": {
    "result": {
      "output": 85.5
    },
    "videoAnalysis": [
      {
        "label": {
          "Angry": 0.33860045146726864,
          "Happy": 3.724604966139955,
          "Neutral": 75.2821670428894,
          "Sad": 3.2731376975169297,
          "Surprise": 0
        },
        "processed": 886,
        "frames": 886
      },
      {
        "label": {
          "Angry": 0.9070294784580499,
          "Happy": 19.727891156462583,
          "Neutral": 14.058956916099774,
          "Sad": 9.977324263038549,
          "Surprise": 0
        },
        "processed": 441,
        "frames": 441
      },
      {
        "label": {
          "Angry": 0.13386880856760375,
          "Happy": 5.756358768406962,
          "Neutral": 29.183400267737618,
          "Sad": 4.149933065595716,
          "Surprise": 0
        },
        "processed": 747,
        "frames": 747
      },
      {
        "label": {
          "Angry": 1.1904761904761905,
          "Happy": 21.296296296296298,
          "Neutral": 41.66666666666667,
          "Sad": 6.084656084656085,
          "Surprise": 0
        },
        "processed": 756,
        "frames": 756
      }
    ],
    "audioAnalysis": [
      "Hello. Well, answering to the second question, my thoughts on artificial intelligence is that it's actually going to replace jobs of human beings. I've seen this live working in Bajaj, where we created an algorithm to automate the reimbursement process, and where we kicked off almost 120 to 150 agents who are manually testing reimbursement. Yeah, so machine learning. Sorry. Artificial intelligence is definitely going to take up jobs in future.",
      "Well, my biggest strength in software engineer is already said I can solve any problem with the power of machine learning. And my biggest weakness is that I am very bad at designing the architecture of a whole application. As such.",
      "Okay, now, trying to answer the third question. Well, my salary expectations are not really that heavy. I would just expect somewhere around 20 or 25 LPA. And I'll tell you why. Because I have almost two to three years of intense experience in solving real world problems with machine learning. So not really over frugal about my salary.",
      "Well, why I want to work with Hair is that yeah, Hair has a really good, amazing opportunity where, for software engineers, like, you know well so software engineers are really paid off well, and you actually get to solve the problems which impact other people's life."
    ]
  }
}]